function 读取达产率(){
    var mytable = document.getElementById("达产率表格");
    var data = [];
    for(var i=0,rows=mytable.rows.length; i<rows; i++){
         for(var j=0,cells=mytable.rows[i].cells.length; j<cells; j++){
            if(!data[i]){
                data[i] = new Array();
            }
            data[i][j] = mytable.rows[i].cells[j].innerHTML;
         }
    }

    var str1 = "";
    for(i=1; i<=20; i++){
        str1 = str1 + data[1][i] + ','
    }

    $("#达产率").val(str1);
}

$("#submit1").click(function () {
    读取达产率();
    alert($("#达产率").val());
});


function  saveData() {
    读取达产率();
     $.ajax({
        type: "POST",
        dataType: "json",
        headers: {"X-CSRFToken": $.cookie('csrftoken')},
        url: "/moduletest/saveProjectInfo/",
        data: {
            达产率: $("#达产率").val(),
            项目名称: $("#负荷数据选择").val(),
            并网模式: $("#并网模式").val(),
            燃气轮机最大台数: $("#燃气轮机最大台数").val(),
            燃气轮机最大规模: $("#燃气轮机最大规模").val(),
            燃气轮机最小规模: $("#燃气轮机最小规模").val(),
            燃气内燃机最大台数: $("#燃气内燃机最大台数").val(),
            燃气内燃机最大规模: $("#燃气内燃机最大规模").val(),
            燃气内燃机最小规模: $("#燃气内燃机最小规模").val(),

            燃气价格: $("#燃气价格").val(),
            水价格: $("#水价格").val(),
            蒸汽价格: $("#蒸汽价格").val(),
            燃气热值: $("#燃气热值").val(),
            管损率: $("#管损率").val(),
            水蒸气焓差: $("#水蒸气焓差").val(),
            土建工程建筑: $("#土建工程建筑").val(),
            管网投资总费用: $("#管网投资总费用").val(),
            辅助工程_设备_设定值: $("#辅助工程_设备_设定值").val(),
            辅助工程_安装_设定值: $("#辅助工程_安装_设定值").val(),
            电力接入费: $("#电力接入费").val(),
            燃气工程费: $("#燃气工程费").val(),
            土地费: $("#土地费").val(),
            收购费用: $("#收购费用").val(),
            人数: $("#人数").val(),
            工资: $("#工资").val(),
            变压器容量费: $("#变压器容量费").val(),
            系统备用容量费: $("#系统备用容量费").val(),
            土地租金: $("#土地租金").val(),
            设备租金: $("#设备租金").val(),
            额外天然气销售年总收入: $("#额外天然气销售年总收入").val(),
            额外天然气销售年总成本: $("#额外天然气销售年总成本").val(),

            燃气轮机满负荷运行小时数限制: $("#燃气轮机满负荷运行小时数限制").val(),
            燃气轮机自耗电比例: $("#燃气轮机自耗电比例").val(),
            燃气轮机最低运行负荷比例: $("#燃气轮机最低运行负荷比例").val(),
            燃气轮机发电效率修正: $("#燃气轮机发电效率修正").val(),
            燃气轮机烟气流量修正: $("#燃气轮机烟气流量修正").val(),
            燃气轮机排烟温度修正: $("#燃气轮机排烟温度修正").val(),
            燃气轮机发电功率修正: $("#燃气轮机发电功率修正").val(),
            燃气内燃机满负荷运行小时数限制: $("#燃气内燃机满负荷运行小时数限制").val(),
            燃气内燃机自耗电比例: $("#燃气内燃机自耗电比例").val(),
            燃气内燃机最低运行负荷比例: $("#燃气内燃机最低运行负荷比例").val(),
            燃气锅炉单位产汽耗电量: $("#燃气锅炉单位产汽耗电量").val(),
            锅炉耗水率: $("#锅炉耗水率").val(),
            燃气锅炉效率: $("#燃气锅炉效率").val(),
            余热锅炉效率: $("#余热锅炉效率").val(),
            余热锅炉单位产汽耗电量: $("#余热锅炉单位产汽耗电量").val(),
            冷却后烟气温度: $("#冷却后烟气温度").val(),
            余热锅炉单位造价: $("#余热锅炉单位造价").val(),
            燃气锅炉单位造价: $("#燃气锅炉单位造价").val(),
            天然气是否先用后付: $("#天然气是否先用后付").val(),
            电费是否先用后付: $("#电费是否先用后付").val(),
            水费是否先用后付: $("#水费是否先用后付").val(),
            工资是否先用后付: $("#工资是否先用后付").val(),
            维修费是否先用后付: $("#维修费是否先用后付").val(),
        },
        success: function (json) {
            alert("已保存项目参数设置");
        }
    });
}

$("#submit1").click(function(){
    saveData()
 });

$("#saveInfo").click(function(){
    saveData()
 });

function loadData() {
   var 项目名称 = $("#负荷数据选择").val();
    $.ajax({
        type: "POST",
        dataType: "json",
        headers: {"X-CSRFToken": $.cookie('csrftoken')},
        url: "/moduletest/loadProjectInfo/",
        data: {
            项目名称: 项目名称
        },
        success: function (json) {
            alert("已读取-" + 项目名称 + "-项目信息");

            var 达产率列表 = json.达产率;
            var i = 0;
            $("#达产率表").children().not(".thead").each(function(){
                $(this).html(达产率列表[i]);
                i = i+1;
            });

            $("#并网模式").val(json.并网模式);
            $("#燃气轮机最大台数").val(json.燃气轮机最大台数);
            $("#燃气轮机最大规模").val(json.燃气轮机最大规模);
            $("#燃气轮机最小规模").val(json.燃气轮机最小规模);
            $("#燃气内燃机最大台数").val(json.燃气内燃机最大台数);
            $("#燃气内燃机最大规模").val(json.燃气内燃机最大规模);
            $("#燃气内燃机最小规模").val(json.燃气内燃机最小规模);

            $("#燃气价格").val(json.燃气价格);
            $("#水价格").val(json.水价格);
            $("#蒸汽价格").val(json.蒸汽价格);
            $("#燃气热值").val(json.燃气热值);
            $("#管损率").val(json.管损率);
            $("#水蒸气焓差").val(json.水蒸气焓差);
            $("#土建工程建筑").val(json.土建工程建筑);
            $("#管网投资总费用").val(json.管网投资总费用);
            $("#辅助工程_设备_设定值").val(json.辅助工程_设备_设定值);
            $("#辅助工程_安装_设定值").val(json.辅助工程_安装_设定值);
            $("#电力接入费").val(json.电力接入费);
            $("#燃气工程费").val(json.燃气工程费);
            $("#土地费").val(json.土地费);
            $("#收购费用").val(json.收购费用);
            $("#人数").val(json.人数);
            $("#工资").val(json.工资);
            $("#变压器容量费").val(json.变压器容量费);
            $("#系统备用容量费").val(json.系统备用容量费);
            $("#土地租金").val(json.土地租金);
            $("#设备租金").val(json.设备租金);
            $("#额外天然气销售年总收入").val(json.额外天然气销售年总收入);
            $("#额外天然气销售年总成本").val(json.额外天然气销售年总成本);

            $("#燃气轮机满负荷运行小时数限制").val(json.燃气轮机满负荷运行小时数限制);
            $("#燃气轮机自耗电比例").val(json.燃气轮机自耗电比例);
            $("#燃气轮机最低运行负荷比例").val(json.燃气轮机最低运行负荷比例);
            $("#燃气轮机发电效率修正").val(json.燃气轮机发电效率修正);
            $("#燃气轮机烟气流量修正").val(json.燃气轮机烟气流量修正);
            $("#燃气轮机排烟温度修正").val(json.燃气轮机排烟温度修正);
            $("#燃气轮机发电功率修正").val(json.燃气轮机发电功率修正);
            $("#燃气内燃机满负荷运行小时数限制").val(json.燃气内燃机满负荷运行小时数限制);
            $("#燃气内燃机自耗电比例").val(json.燃气内燃机自耗电比例);
            $("#燃气内燃机最低运行负荷比例").val(json.燃气内燃机最低运行负荷比例);
            $("#燃气锅炉单位产汽耗电量").val(json.燃气锅炉单位产汽耗电量);
            $("#锅炉耗水率").val(json.锅炉耗水率);
            $("#燃气锅炉效率").val(json.燃气锅炉效率);
            $("#余热锅炉效率").val(json.余热锅炉效率);
            $("#余热锅炉单位产汽耗电量").val(json.余热锅炉单位产汽耗电量);
            $("#冷却后烟气温度").val(json.冷却后烟气温度);
            $("#余热锅炉单位造价").val(json.余热锅炉单位造价);
            $("#燃气锅炉单位造价").val(json.燃气锅炉单位造价);
            $("#天然气是否先用后付").val(json.天然气是否先用后付);
            $("#电费是否先用后付").val(json.电费是否先用后付);
            $("#水费是否先用后付").val(json.水费是否先用后付);
            $("#工资是否先用后付").val(json.工资是否先用后付);
            $("#维修费是否先用后付").val(json.维修费是否先用后付);
        }
    })
}

$("#负荷数据选择").change(function(){
    loadData();
});



$(document).ready(function(){
    loadData();
});